<a href="https://colab.research.google.com/github/NicoGangi5/Titanic-Machine-Learning-from-Disaster/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import io
from google.colab import files
from sklearn.model_selection import train_test_split
import keras
from keras.models import Sequential
from keras.layers import Dense
from keras.utils import to_categorical

from keras.applications import VGG16

In [ ]:
uploaded = files.upload()
uploaded_test = files.upload()
res = files.upload()

Saving train.csv to train.csv

Saving test.csv to test.csv

Saving results.csv to results.csv

In [ ]:
#Train data set 

dataset = pd.read_csv(io.BytesIO(uploaded['train.csv']))

In [ ]:
dataset.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
dataset.shape

(891, 12)

In [ ]:
print("Survived: ", dataset['Survived'].value_counts()[1])
print("Not survived: ", dataset['Survived'].value_counts()[0])

Survived:  342
Not survived:  549

In [ ]:
dataset.drop(['Name','Cabin', 'Ticket'], axis=1, inplace=True)
dataset.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [ ]:
dataset['Sex'].replace(to_replace=['male','female'], value=[1,0], inplace=True)
dataset.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    1  22.0      1      0   7.2500        S
1            2         1       1    0  38.0      1      0  71.2833        C
2            3         1       3    0  26.0      0      0   7.9250        S
3            4         1       1    0  35.0      1      0  53.1000        S
4            5         0       3    1  35.0      0      0   8.0500        S

In [ ]:
dataset.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [ ]:
dataset['Age'] = dataset['Age'].fillna(dataset['Age'].mean())
dataset.head(6)

   PassengerId  Survived  Pclass  Sex  ...  SibSp  Parch     Fare  Embarked
0            1         0       3    1  ...      1      0   7.2500         S
1            2         1       1    0  ...      1      0  71.2833         C
2            3         1       3    0  ...      0      0   7.9250         S
3            4         1       1    0  ...      1      0  53.1000         S
4            5         0       3    1  ...      0      0   8.0500         S
5            6         0       3    1  ...      0      0   8.4583         Q

[6 rows x 9 columns]

In [ ]:
dataset['Embarked'].replace(to_replace=['S','C','Q'], value=[0, 1, 2], inplace=True)
dataset['Embarked'] = dataset['Embarked'].fillna(dataset['Embarked'].mean())
dataset.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500       0.0
1            2         1       1    0  38.0      1      0  71.2833       1.0
2            3         1       3    0  26.0      0      0   7.9250       0.0
3            4         1       1    0  35.0      1      0  53.1000       0.0
4            5         0       3    1  35.0      0      0   8.0500       0.0

In [ ]:
dataset['Fare'].apply(np.ceil)
#dataset['Fare'] = dataset['Fare'].astype(int)
#dataset['Age'] = dataset['Age'].astype(int)
#dataset['Embarked'] = dataset['Embarked'].astype(int)
dataset.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500       0.0
1            2         1       1    0  38.0      1      0  71.2833       1.0
2            3         1       3    0  26.0      0      0   7.9250       0.0
3            4         1       1    0  35.0      1      0  53.1000       0.0
4            5         0       3    1  35.0      0      0   8.0500       0.0

In [ ]:
dataset.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [ ]:
Y = dataset['Survived']
Y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [ ]:
X = dataset
X.drop(['Survived'], axis=1, inplace=True)
X.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1       3    1  22.0      1      0   7.2500       0.0
1            2       1    0  38.0      1      0  71.2833       1.0
2            3       3    0  26.0      0      0   7.9250       0.0
3            4       1    0  35.0      1      0  53.1000       0.0
4            5       3    1  35.0      0      0   8.0500       0.0

In [ ]:
X = X/X.max()
X.describe()

       PassengerId      Pclass         Sex  ...       Parch        Fare    Embarked
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean      0.500561    0.769547    0.647587  ...    0.063599    0.062858    0.181102
std       0.288837    0.278690    0.477990  ...    0.134343    0.096995    0.317721
min       0.001122    0.333333    0.000000  ...    0.000000    0.000000    0.000000
25%       0.250842    0.666667    0.000000  ...    0.000000    0.015440    0.000000
50%       0.500561    1.000000    1.000000  ...    0.000000    0.028213    0.000000
75%       0.750281    1.000000    1.000000  ...    0.000000    0.060508    0.500000
max       1.000000    1.000000    1.000000  ...    1.000000    1.000000    1.000000

[8 rows x 8 columns]

In [ ]:
X_array = np.array(X)
Y_array = np.array(Y)

In [ ]:
X_array

array([[0.00112233, 1.        , 1.        , ..., 0.        , 0.01415106,
        0.        ],
       [0.00224467, 0.33333333, 0.        , ..., 0.        , 0.13913574,
        0.5       ],
       [0.003367  , 1.        , 0.        , ..., 0.        , 0.01546857,
        0.        ],
       ...,
       [0.99775533, 1.        , 0.        , ..., 0.33333333, 0.04577135,
        0.        ],
       [0.99887767, 0.33333333, 1.        , ..., 0.        , 0.0585561 ,
        0.5       ],
       [1.        , 1.        , 1.        , ..., 0.        , 0.01512699,
        1.        ]])

In [ ]:
X_train, X_test, y_train, y_test = train_test_split( X_array, Y_array, test_size=0.2, random_state=4)
print ('Train set:', X_train.shape,  y_train.shape)
print ('Test set:', X_test.shape,  y_test.shape)

Train set: (712, 8) (712,)
Test set: (179, 8) (179,)

In [ ]:
X_train.shape

(712, 8)

In [ ]:
# one hot encode outputs
y_train = to_categorical(y_train)
y_test = to_categorical(y_test)

count_classes = y_test.shape[1]
print(count_classes)

2

In [ ]:
# define classification model
def classification_model():
    # create model
    model = Sequential()
    model.add(Dense(500, activation='relu', input_dim=X_train.shape[1]))
    model.add(Dense(200, activation='relu'))
    model.add(Dense(50, activation='relu'))
    model.add(Dense(2, activation='softmax'))

    # Compile the model
    model.compile(optimizer='Adam', 
                  loss='binary_crossentropy', 
                  metrics=['accuracy'])
    return model

In [ ]:
# build the model
model = classification_model()

# fit the model
model.fit(X_train, y_train, validation_data=(X_test, y_test), epochs=25)

Epoch 1/25
23/23 [==============================] - 1s 23ms/step - loss: 0.6374 - accuracy: 0.6994 - val_loss: 0.4691 - val_accuracy: 0.8380
Epoch 2/25
23/23 [==============================] - 0s 5ms/step - loss: 0.5129 - accuracy: 0.7749 - val_loss: 0.4488 - val_accuracy: 0.8268
Epoch 3/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4751 - accuracy: 0.7986 - val_loss: 0.4433 - val_accuracy: 0.8045
Epoch 4/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4624 - accuracy: 0.7986 - val_loss: 0.4289 - val_accuracy: 0.8436
Epoch 5/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4614 - accuracy: 0.7984 - val_loss: 0.4249 - val_accuracy: 0.8268
Epoch 6/25
23/23 [==============================] - 0s 10ms/step - loss: 0.4480 - accuracy: 0.8069 - val_loss: 0.4101 - val_accuracy: 0.8324
Epoch 7/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4337 - accuracy: 0.8053 - val_loss: 0.4162 - val_accuracy: 0.8380
Epoch 8/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4367 - accuracy: 0.7982 - val_loss: 0.4052 - val_accuracy: 0.8212
Epoch 9/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4140 - accuracy: 0.8212 - val_loss: 0.4054 - val_accuracy: 0.8436
Epoch 10/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4462 - accuracy: 0.8047 - val_loss: 0.4110 - val_accuracy: 0.8212
Epoch 11/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4123 - accuracy: 0.8118 - val_loss: 0.3966 - val_accuracy: 0.8212
Epoch 12/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4073 - accuracy: 0.8266 - val_loss: 0.3929 - val_accuracy: 0.8212
Epoch 13/25
23/23 [==============================] - 0s 6ms/step - loss: 0.3911 - accuracy: 0.8447 - val_loss: 0.4014 - val_accuracy: 0.8268
Epoch 14/25
23/23 [==============================] - 0s 4ms/step - loss: 0.3898 - accuracy: 0.8391 - val_loss: 0.3978 - val_accuracy: 0.8436
Epoch 15/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4527 - accuracy: 0.8011 - val_loss: 0.3952 - val_accuracy: 0.8212
Epoch 16/25
23/23 [==============================] - 0s 5ms/step - loss: 0.3891 - accuracy: 0.8359 - val_loss: 0.4098 - val_accuracy: 0.8547
Epoch 17/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4124 - accuracy: 0.8216 - val_loss: 0.3957 - val_accuracy: 0.8212
Epoch 18/25
23/23 [==============================] - 0s 5ms/step - loss: 0.3532 - accuracy: 0.8555 - val_loss: 0.4002 - val_accuracy: 0.8492
Epoch 19/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4009 - accuracy: 0.8169 - val_loss: 0.3873 - val_accuracy: 0.8380
Epoch 20/25
23/23 [==============================] - 0s 5ms/step - loss: 0.3618 - accuracy: 0.8537 - val_loss: 0.3929 - val_accuracy: 0.8324
Epoch 21/25
23/23 [==============================] - 0s 5ms/step - loss: 0.4238 - accuracy: 0.8079 - val_loss: 0.3920 - val_accuracy: 0.8547
Epoch 22/25
23/23 [==============================] - 0s 5ms/step - loss: 0.3569 - accuracy: 0.8570 - val_loss: 0.4127 - val_accuracy: 0.8547
Epoch 23/25
23/23 [==============================] - 0s 5ms/step - loss: 0.3818 - accuracy: 0.8604 - val_loss: 0.4028 - val_accuracy: 0.8492
Epoch 24/25
23/23 [==============================] - 0s 5ms/step - loss: 0.3794 - accuracy: 0.8170 - val_loss: 0.3939 - val_accuracy: 0.8436
Epoch 25/25
23/23 [==============================] - 0s 5ms/step - loss: 0.3817 - accuracy: 0.8447 - val_loss: 0.4064 - val_accuracy: 0.8268

In [ ]:
pred_train= model.predict(X_train)
scores = model.evaluate(X_train, y_train, verbose=0)
print('Accuracy on training data: {}% \n Error on training data: {}'.format(scores[1], 1 - scores[1]))   
 
pred_test= model.predict(X_test)
scores2 = model.evaluate(X_test, y_test, verbose=0)
print('Accuracy on test data: {}% \n Error on test data: {}'.format(scores2[1], 1 - scores2[1]))

Accuracy on training data: 0.8441011309623718%
 Error on training data: 0.15589886903762817
Accuracy on test data: 0.826815664768219%
 Error on test data: 0.173184335231781

In [ ]:
model.summary()

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 500)               4500
_________________________________________________________________
dense_1 (Dense)              (None, 200)               100200
_________________________________________________________________
dense_2 (Dense)              (None, 50)                10050
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 102
=================================================================
Total params: 114,852
Trainable params: 114,852
Non-trainable params: 0
_________________________________________________________________

In [ ]:
#Test data set 

testSet = pd.read_csv(io.BytesIO(uploaded_test['test.csv']))
final = pd.read_csv(io.BytesIO(res['results.csv']))

testSet.drop(['Name','Cabin', 'Ticket'], axis=1, inplace=True)
testSet['Sex'].replace(to_replace=['male','female'], value=[1,0], inplace=True)
testSet['Age'] = testSet['Age'].fillna(testSet['Age'].mean())
testSet['Embarked'].replace(to_replace=['S','C','Q'], value=[0, 1, 2], inplace=True)
testSet['Embarked'] = testSet['Embarked'].fillna(testSet['Embarked'].mean())
testSet['Fare'].apply(np.ceil)
test = testSet/testSet.max()
test.head()

   PassengerId    Pclass  Sex       Age  SibSp     Parch      Fare  Embarked
0     0.681436  1.000000  1.0  0.453947  0.000  0.000000  0.015282       1.0
1     0.682200  1.000000  0.0  0.618421  0.125  0.000000  0.013663       0.0
2     0.682964  0.666667  1.0  0.815789  0.000  0.000000  0.018909       1.0
3     0.683728  1.000000  1.0  0.355263  0.000  0.000000  0.016908       0.0
4     0.684492  1.000000  0.0  0.289474  0.125  0.111111  0.023984       0.0

In [ ]:
#Predict

pred= model.predict(test)
pred.item(1, 0)

surv = []
for i in range(len(pred)):
  if pred.item(i, 0) > pred.item(i, 1):
    surv.append(0)
  else:
    surv.append(1)

In [ ]:
final['Survived'] = surv
final.to_csv("results.csv", index=False)